Revit 2027 API
MetallicpaintFinishType Enumeration
 The enumerated type representing the permitted values for the asset property "MetallicpaintFinish" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum MetallicpaintFinishType
Public Enumeration MetallicpaintFinishType
public enum class MetallicpaintFinishType
type MetallicpaintFinishType
Members
Member name | Value | Description
Peeling | 1
Smooth | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace